#+TITLE: Kapitel 4: Funktionen, Teil 1
#+INCLUDE: "../template/header.org"

#+STARTUP: showeverything

# TODO states: looks like this has to go on main file and cannot be
# included 
#+TODO: TODO(t) | UEBUNG(u) DONE(d)
#+OPTIONS: tasks:todo

#+LATEX_HEADER: \setcounter{chapter}{4}

** Aufruf: Gleicher Name mehrfach? 

Was passiert bei: 

#+BEGIN_SRC python :exports both :results output
  def f(x):
      return 2*x

  x = 17
  x = f(x)
#+END_SRC 

#+RESULTS:
: 34


** Weitere Aspekte von ~print~: Mehrere Parameter 

- ~print~ kann eine /beliebige Anzahl/ an Parametern verarbeiten
  - Durch Komma
  - Werden nach einander ausgegeben 
  - (Das geht bei allen Funktionen, siehe späteres Kapitel) 
- Beispiel: 

#+BEGIN_SRC python :exports both :results output
print("Hallo", "GP", 1)
#+END_SRC 

#+RESULTS:
: Hallo GP 1


*** Version 1 

#+BEGIN_SRC python :exports both :results output
print("Hallo")
print("GP1")
#+END_SRC 

#+RESULTS:
: Hallo
: GP1

*** Version 2 


#+BEGIN_SRC python :exports both :results output
print("Hallo", end=" ")
print("GP1")
#+END_SRC 

#+RESULTS:
: Hallo GP1




** Weiteres Beispiel für Funktionen 

Was wird hier ausgegeben? 

#+BEGIN_SRC python :exports code :results output
  def m(x):
      x += 1
      return x*x

  i = 2
  i = m(i) + i
  print(i)
  i = 2
  i = m(m(i)) + m(i) + i
  print(i)
#+END_SRC 

#+RESULTS:
: 11
: 111


